neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32F7.c
        return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_I2C(hwDMA_Stream_Index stream_index, hwDMA_Peripheral_Direction dir, hwI2C_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwI2C_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if (DMA_Stream_Init_Status[stream_index] == false)
        {
                return hwDMA_NotInit;
        }

        g_dma[stream_index].Instance = DMA_Get_Instance(stream_index);
        if(g_dma[stream_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
        g_dma[stream_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[stream_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[stream_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[stream_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[stream_index].Init.Mode                = DMA_NORMAL;
        g_dma[stream_index].Init.Priority            = DMA_PRIORITY_HIGH;
        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[stream_index].Init.Direction = DMA_MEMORY_TO_PERIPH;

                        switch (index)
                        {
#if defined(I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_1;
                                        break;
#endif
#if defined(I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_7;
                                        break;
#endif
#if defined(I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
#if defined(I2C4_BASE)
                                case hwI2C_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_2;
                                        break;
#endif
#if defined(I2C5_BASE)
                                case hwI2C_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
                        }
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;

                        switch (index)
                        {
#if defined(I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_1;
                                        break;
#endif
#if defined(I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_7;
                                        break;
#endif
#if defined(I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
#if defined(I2C4_BASE)
                                case hwI2C_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_2;
                                        break;
#endif
#if defined(I2C5_BASE)
                                case hwI2C_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[stream_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                __HAL_LINKDMA(&g_i2c[index], hdmatx, g_dma[stream_index]);
                break;

                case hwDMA_Peripheral_Direction_RX:
                __HAL_LINKDMA(&g_i2c[index], hdmarx, g_dma[stream_index]);
                break;

                default:
                return hwDMA_InvalidParameter;
        }

        return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_SPI(hwDMA_Stream_Index stream_index, hwDMA_Peripheral_Direction dir, hwSPI_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwSPI_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Stream_Init_Status[stream_index]==false)
        {
                return hwDMA_NotInit;
        }

        g_dma[stream_index].Instance = DMA_Get_Instance(stream_index);
        if(g_dma[stream_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
        g_dma[stream_index].Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
        g_dma[stream_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[stream_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[stream_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[stream_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[stream_index].Init.Mode                = DMA_NORMAL;
        g_dma[stream_index].Init.Priority            = DMA_PRIORITY_HIGH;
        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[stream_index].Init.Direction = DMA_MEMORY_TO_PERIPH;
                        switch(index)
                        {
#if defined(SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
#if defined(SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_0;
                                        break;
#endif
#if defined(SPI3_BASE)
                                case hwSPI_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_0;
                                        break;
#endif
#if defined(SPI4_BASE)
                                case hwSPI_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined(SPI5_BASE)
                                case hwSPI_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_2;
                                        break;
#endif
#if defined(SPI6_BASE)
                                case hwSPI_Index_5:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_1;
                                        break;
#endif
                        }
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;
                        switch(index)
                        {
#if defined(SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_3;
                                        break;
#endif
#if defined(SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_0;
                                        break;
#endif
#if defined(SPI3_BASE)
                                case hwSPI_Index_2:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_0;
                                        break;
#endif
#if defined(SPI4_BASE)
                                case hwSPI_Index_3:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_4;
                                        break;
#endif
#if defined(SPI5_BASE)
                                case hwSPI_Index_4:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_2;
                                        break;
#endif
#if defined(SPI6_BASE)
                                case hwSPI_Index_5:
                                        g_dma[stream_index].Init.Channel = DMA_CHANNEL_1;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[stream_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        __HAL_LINKDMA(&g_spi[index], hdmatx, g_dma[stream_index]);
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        __HAL_LINKDMA(&g_spi[index], hdmarx, g_dma[stream_index]);
                        break;
        }

